%% -------- ИСХОДНЫЕ ДАННЫЕ -------- %%
z = [-1.65];
p = [-2.1 -3.41];
k = 1;

T = 0.01;

h = [-0.48 0.24 0.11 0.055 0.026 0.012];

m_akf = 41;
h_padded = [h(:); zeros(m_akf - length(h), 1)];

%% -------- ГЕНЕРАЦИЯ ПОСЛЕДОВАТЕЛЬНОСТИ ПСЕВДОСЛУЧАЙНЫХ -------- %%
n_soob=4096; % длина временного ряда
s_v=rand(1,n_soob); % белый шум (0,1)

%% -------- РАСЧЁТ КОЭФФИЦИЕНТОВ -------- %%
denominator = (1+5.51*T+7.161*T*T);
zd=[(1+1.65*T)/denominator -1/denominator];
pd=[-(2+11.02*T)/denominator 1/denominator];

[b1, a1] = eqtflength(zd, pd);

model_2 = filter(b1, a1, s_v); % РЦФ (8)
[c_akf, lags] = xcorr(model_2, m_akf,'coeff'); % расчёт АКФ

%% -------- ПОСТРОЕНИЕ ДИСКРЕТНЫХ ФУНКЦИЙ ПСМ -------- %%
g_asi=fft(c_akf);
g_sim=fftshift(g_asi);

figure(2)
plot(lags, g_sim, '-w', 'LineWidth', 2)

%% ---- ИСПОЛЬЗОВАНИЕ fir2 ---- %%
nf=11; % порядок фильтра

% Массив сетки частот и желаемая характеристика для
f0=[0.0 0.1 0.2 0.2 0.3 0.4 0.5 0.6 0.7 0.7 0.8 0.9 1.0];
% желаемая характеристика ПФ
H_p =[0.0 0.0 0.0 1.0 1.0 1.0 1.0 1.0 1.0 0.0 0.0 0.0 0.0];
% желаемая характеристика ЗФ
H_z =[1.0 1.0 1.0 0.0 0.0 0.0 0.0 0.0 0.0 1.0 1.0 1.0 1.0];

b3 = fir2(lags, g_sim,H_p); % синтез
% контрольный расчёт получившегося
[h3,w3] = freqz(b3,1.0,128);

%% ---- ИСПРОЛЬЗОВАНИЕ yulewalk ---- %%
% массив частот НЧ и ВЧ фильтров, где на характеристике
% ступень перехода, там частоты дублируются
f0=[0.0 0.1 0.2 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0];

% для ФНЧ
H_nc=[1.0 1.0 1.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0];
% для ФВЧ
H_vc=[0.0 0.0 0.0 1.0 1.0 1.0 1.0 1.0 1.0 1.0 1.0 1.0];

[b_nc,a_nc]=yulewalk(nf, f0, H_nc); % синтез
% ЧХ синтезированного фильтра для контроля
[h1,w1]=freqz(b_nc,a_nc,128);

%%
figure(1)
plot(f0, H_nc, '-w', 'LineWidth', 2);
hold on; 
plot(w1/pi, abs(h1), '--g', 'LineWidth', 2);
grid on;
title('Frequency responses');
xlabel('Normalized Frequency');
ylabel('\it H(\omega / \pi )');
legend('Dreams', 'Result', 'Location', 'northeast');  % <-- современный синтаксис