%% ---------------------------------------------
%  Исходные данные непрерывной системы
% ----------------------------------------------

z = [-1.65];
p = [-2.1 -3.41];
k = 1;

[b, a] = zp2tf(z, p, k);   % передаточная функция непрерывной системы

T = 0.01;
fs = 1/T;      % частота дискретизации
N_imp = 50;   % число отсчётов для временных характеристик

%% ---------------------------------------------
% 1. НЦФ — импульсная характеристика (через residue)
% ----------------------------------------------

[r,p,k] = residue(b,a);

tau = [0:T:N_imp]; % вектор значений времени
h = zeros(size(tau)); % заготовка под значения ИХ

for n=[1:length(r)]
h = h + r(n).*exp(p(n).*tau); % n-e слагаемое
end

figure
plot(tau, h,'LineWidth', 2);
grid on;
title('The Impulse response of System');
xlabel('\it \tau');
ylabel('\it h(\tau))');

%% ---------------------------------------------
% 1.1. НЦФ — переходная характеристика (интеграл ИХ)
% ----------------------------------------------

pp_nc = zeros(size(tau));

for k=[1:length(r)]
pp_nc = pp_nc + r(k)./p(k).*exp(p(k).*tau); % n-e слагаемое
end

pp_nc = pp_nc + b(1)/a(1)

figure
plot(tau, pp_nc, 'LineWidth', 2)
grid on
title('Step Response (NCF)')
xlabel('t')
ylabel('p(t)')

%% ---------------------------------------------
% 2. Построение РЦФ методом инвариантной импульсной характеристики 
% ----------------------------------------------

denominator = (1+5.51*T+7.161*T*T);
zd=[(1+1.65*T)/denominator -1/denominator];
pd=[-(2+11.02*T)/denominator 1/denominator];

[b1, a1] = eqtflength(zd, pd);
[az,bz] = impinvar(a1,b1,fs);

%% ---------------------------------------------
% 3.1. Расчёт импульсной характеристики дискретной системы
% ----------------------------------------------

[h, t_h] = impz(zd, pd, N_imp);

figure
stem(t_h, h,'LineWidth',2);
grid on
title('Расчёт импульсной характеристики дискретной системы')
xlabel('n')
ylabel('h[n]')

%% ---------------------------------------------
% 3.2. Расчёт переходного процесса дискретной системы
% ----------------------------------------------

[pp,t_pp]=stepz(zd, pd, 50,fs);

figure
plot(t_pp, pp, 'LineWidth', 2)
grid on
title('Расчёт переходного процесса дискретной системы')
xlabel('n')
ylabel('p[n]')

%% ---------------------------------------------
% 6. Определение нулей и полюсов дискретной системы
% ----------------------------------------------

[b2, a2] = eqtflength(zd, pd); 
[z1, p1, k1] = tf2zp(b2, a2);

figure
zplane(z1, p1);
hold on;
grid
title('Определение нулей и полюсов дискретной системы')

%% ---------------------------------------------
% 4. Построение частотных характеристик дискретной системы
% ----------------------------------------------

w = freqspace(2*512); % Формируем вектор частот

K = freqz(b2, a2, w*pi);

figure
freqz(b2, a2, w*pi);
K_amp = abs(K); % Расчёт АЧХ
K_amp = 20*log10(K_amp); % Преобразуем АЧХ в децибелы
figure
plot(w, K_amp); % рисуем отдельно график АЧХ
title('The Magnitude of Filter');
xlabel('Normalized frequence (x\pi rad by sample)');
ylabel('dB');
grid

phasez(b2, a2)

%% ---------------------------------------------
% 5. Построение фазовой и групповой задержки дискретного фильтра
% ----------------------------------------------

% Расчет фазовой задержки фильтра
figure
phasedelay(b2, a2)

% Расчет групповой задержки фильтра
figure
grpdelay(b2, a2)